{"config": [{"config": {"batch_input_shape": [null, 20, 11, 1], "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [2, 2], "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 48, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [2, 2], "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 120, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [2, 2], "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.4, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 30, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow"}