{"config": [{"config": {"filters": 32, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 20, 11, 1], "activation": "relu", "kernel_size": [2, 2], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 48, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [2, 2], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 120, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [2, 2], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "trainable": true, "units": 128, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "trainable": true, "units": 64, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "trainable": true, "units": 30, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}